# Homebrew formulae
brew "bat"
brew "fd"
brew "fzf"
brew "gh"
brew "git-delta"
brew "htop"
brew "lazygit"
brew "mas"
brew "mise"
brew "neovim"
brew "prettyping"
brew "ripgrep"
brew "speedtest-cli"
brew "tmux"
brew "yadm"
brew "zoxide"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

# Homebrew casks
cask "bartender"
cask "docker"
cask "istat-menus"
cask "iterm2"
cask "raycast"

# Mac App Store
mas "1password", id: 1333542190
