# Install:
#   brew bundle --global
# Sync (cleanup):
#   brew bundle --global --force cleanup

tap "homebrew/bundle"

cask_args appdir: "/Applications", require_sha: true

# Homebrew formulae
brew "chezmoi"
brew "colima"
brew "docker"
brew "fd"
brew "fzf"
brew "gh"
brew "git"
brew "git-delta"
brew "gnupg"
brew "htop"
brew "jq"
brew "lazygit"
brew "mas"
brew "mise"
brew "neovim"
brew "pinentry-mac"
brew "prettyping"
brew "ripgrep"
brew "starship"
brew "tmux"
brew "zoxide"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

# Homebrew casks
cask_args appdir: "/Applications", require_sha: true
cask "1password"
cask "1password-cli"
cask "font-jetbrains-mono-nerd-font"
cask "istat-menus", args: { require_sha: false }
cask "iterm2"
cask "raycast"
