# Install:
#   brew bundle --global
# Sync (cleanup):
#   brew bundle --global --force cleanup

cask_args appdir: "/Applications", require_sha: true

# ── Common ────────────────────────────────────────────────────────────────────
brew "bat"
brew "chezmoi"
brew "colima"
brew "docker"
brew "docker-buildx"
brew "docker-completion"
brew "docker-compose"
brew "dockutil"
brew "eza"
brew "fd"
brew "fzf"
brew "gh"
brew "git"
brew "git-delta"
brew "gnupg"
brew "htop"
brew "jq"
brew "lazygit"
brew "mas"
brew "mise"
brew "neovim"
brew "openspec"
brew "pinentry-mac"
brew "prettyping"
brew "ripgrep"
brew "starship"
brew "tmux"
brew "zoxide"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

cask "1password"
cask "1password-cli"
cask "font-jetbrains-mono-nerd-font"
cask "ghostty"
cask "raycast"

# ── Personal only ─────────────────────────────────────────────────────────────
{{- if eq .profile "personal" }}
cask "copilot-cli"
{{- end }}

# ── Work only ─────────────────────────────────────────────────────────────────
{{- if eq .profile "work" }}
tap "hashicorp/tap"

brew "aws-cdk"
brew "awscli"
brew "hashicorp/tap/terraform"

cask "kiro-cli"
{{- end }}
