# Install:
#   brew bundle --global
# Sync (cleanup):
#   brew bundle --global --force cleanup

cask_args appdir: "/Applications", require_sha: true

# Homebrew formulae
brew "chezmoi"
brew "fd"
brew "fzf"
brew "gh"
brew "git-delta"
brew "jq"
brew "lazygit"
brew "mas"
brew "mise"
brew "neovim"
brew "ripgrep"
brew "tmux"
brew "zoxide"
brew "zsh-autocomplete"
brew "zsh-syntax-highlighting"

# Homebrew casks
cask "docker"
cask "1password"
cask "1password-cli"
cask "istat-menus"
cask "iterm2"
cask "raycast"
